import { MainContainer, Title, Container, Text, ContainerTitle } from "./Privacy/PrivacyStyles";

export default function Policy() {
    return (
        <MainContainer>
            <Title>Политика конфиденциальности</Title>
            <Container>
                <ContainerTitle>Политика конфиденциальности</ContainerTitle>

                <Text>Дата вступления в силу: данные отсутствуют</Text>

                <Text>Мы, Drunk Wizard Studio, уважаем вашу конфиденциальность и стремимся защищать ваши персональные данные. Эта политика конфиденциальности объясняет, как мы собираем, используем, раскрываем и защищаем вашу информацию, когда вы посещаете наш сайт CodeCollector.</Text>

                <ContainerTitle>1. Сбор информации</ContainerTitle>

                <Text>Мы можем собирать информацию о вас различными способами, включая:</Text>

                <Text>- <strong>Личная информация</strong>: Когда вы регистрируетесь на нашем сайте, подписываетесь на рассылку, заполняете форму или взаимодействуете с нами, мы можем собирать личную информацию, такую как ваше имя, адрес электронной почты, номер телефона и другую информацию, которую вы предоставляете.</Text>

                <Text>- <strong>Автоматически собранная информация</strong>: Мы можем собирать информацию автоматически, включая вашу IP-адрес, тип браузера, операционную систему, страницы, которые вы посещаете, время, проведенное на этих страницах, и другие данные об использовании.</Text>

                <Text>- <strong>Файлы cookie и аналогичные технологии</strong>: Мы используем файлы cookie и аналогичные технологии для сбора информации о вашем взаимодействии с нашим сайтом. Вы можете настроить свой браузер для отклонения всех файлов cookie или для уведомления вас, когда они отправляются. Однако, если вы не принимаете файлы cookie, это может повлиять на ваше использование нашего сайта.</Text>

                <ContainerTitle>2. Использование информации</ContainerTitle>

                <Text>Мы можем использовать собранную информацию для следующих целей:</Text>

                <Text>- Для предоставления, поддержки и улучшения нашего сайта и услуг.</Text>
                <Text>- Для обработки ваших запросов и ответов на ваши комментарии и вопросы.</Text>
                <Text>- Для отправки вам информации о вашем аккаунте и/или других продуктах и услугах.</Text>
                <Text>- Для отправки вам маркетинговых материалов и предложений, если вы согласились на это.</Text>
                <Text>- Для анализа использования нашего сайта и улучшения его функциональности.</Text>
                <Text>- Для соблюдения юридических обязательств и защиты наших прав.</Text>

                <ContainerTitle>3. Раскрытие информации</ContainerTitle>

                <Text>Мы не будем продавать, обменивать или передавать вашу личную информацию третьим лицам, кроме следующих случаев:</Text>

                <Text>- <strong>Сторонние поставщики услуг</strong>: Мы можем передавать вашу информацию третьим лицам, которые предоставляют услуги от нашего имени, такие как обработка платежей, доставка, маркетинг и аналитика.</Text>

                <Text>- <strong>Законодательные требования</strong>: Мы можем раскрыть вашу информацию, если это требуется по закону или для соблюдения юридических процессов.</Text>

                <ContainerTitle>4. Безопасность данных</ContainerTitle>

                <Text>Мы принимаем разумные меры для защиты вашей информации от несанкционированного доступа, использования или раскрытия. Однако ни один метод передачи по Интернету или метод хранения данных не может быть гарантирован на 100% безопасным. Мы не можем гарантировать абсолютную безопасность вашей информации.</Text>

                <ContainerTitle>5. Ваши права</ContainerTitle>

                <Text>Вы имеете право:</Text>

                <Text>- Запрашивать доступ к вашей личной информации.</Text>
                <Text>- Запрашивать исправление или удаление вашей личной информации.</Text>
                <Text>- Отказаться от получения маркетинговых материалов.</Text>
                <Text>- Ограничить или запретить обработку вашей личной информации.</Text>

                <Text>Чтобы воспользоваться этими правами, пожалуйста, свяжитесь с нами по контактной информации, указанной ниже.</Text>

                <ContainerTitle>6. Изменения в политике конфиденциальности</ContainerTitle>

                <Text>Мы можем периодически обновлять эту политику конфиденциальности. Мы уведомим вас о любых изменениях, разместив новую политику на нашем сайте. Мы рекомендуем вам периодически просматривать эту страницу для получения актуальной информации о нашей политике конфиденциальности.</Text>

                <ContainerTitle>7. Контактная информация</ContainerTitle>

                <Text>Если у вас есть вопросы или комментарии по поводу этой политики конфиденциальности, пожалуйста, свяжитесь с нами:</Text>

                <Text>- Электронная почта: govnocoders@mail.ru</Text>
                <Text>- Телефон: +85 8123 8432 88</Text>

            </Container>
        </MainContainer>
    );
}