import { Container, Article, Text, Img, Title } from "./AboutStyles";
export default function About() {
    return (
        <main>
            <Container>
                <Title>О нас</Title>
                <Article>
                    <Img src="https://i.ibb.co/kQSNddV/Screenshuot-11.png" alt="Логотип DWS"></Img>
                    <Text>Студия программирования DWS (или DWS Studio) — это компания, занимающаяся разработкой программного обеспечения и предоставлением IT-услуг. Вот несколько ключевых аспектов, которые могут быть характерны для такой студии:
                        <br></br><br></br>
                        1. Услуги:

                        • Разработка веб-приложений и мобильных приложений.

                        • Создание программного обеспечения на заказ.

                        • Консультации по вопросам IT и цифровой трансформации.

                        • Поддержка и обслуживание существующих систем.
                        <br></br><br></br>
                        2. Технологии:

                        • Использование современных технологий и языков программирования, таких как Java, Python, JavaScript, C#, PHP и других.

                        • Применение фреймворков и библиотек, таких как React, Angular, Django, .NET и т.д.
                        <br></br><br></br>
                        3. Подход к разработке:

                        • Agile-методологии (Scrum, Kanban) для гибкости и быстрого реагирования на изменения требований.

                        • Тестирование и обеспечение качества (QA) на всех этапах разработки.
                        <br></br><br></br>
                        4. Команда:

                        • Опытные разработчики, дизайнеры, проектные менеджеры и тестировщики, работающие в команде для достижения общих целей.
                        <br></br><br></br>
                        5. Клиенты:

                        • Работа с различными отраслями, включая финансы, здравоохранение, образование, e-commerce и другие.
                        <br></br><br></br>
                        6. Проекты:

                        • Реализация как небольших стартапов, так и крупных корпоративных решений.</Text>
                </Article>
            </Container>
            
        </main>
    );
}