
export const Questions = [
  ["Что такое язык программирования?", "Язык программирования — это формальный язык, состоящий из наборов инструкций, которые могут быть использованы для создания программ, которые управляют поведением машин, таких как компьютеры."],
  ["Какой язык программирования выбрать для начинающего?", "Для начинающих часто рекомендуются языки, такие как Python или JavaScript, так как они имеют простую синтаксис и множество ресурсов для обучения."],
  ["Где я могу найти учебные ресурсы по программированию?", "Существует множество бесплатных и платных ресурсов, включая онлайн-курсы, видеоуроки, книги и документацию. Некоторые популярные платформы: Codecademy, Coursera, Udemy и Khan Academy."],
  ["Что такое открытый исходный код?", "Открытый исходный код — это программное обеспечение, чей исходный код доступен для просмотра, изменения и распространения. Это позволяет разработчикам сотрудничать и улучшать программное обеспечение."],
  ["Как мне начать проект на GitHub?", "Для начала проекта на GitHub вам нужно создать аккаунт, создать новый репозиторий, добавить файлы и сделать первый коммит. Затем вы можете делиться своим проектом с другими."],
  ["Что такое фреймворк?", "Фреймворк — это набор инструментов и библиотек, который упрощает разработку программного обеспечения, предоставляя структуру и стандартные практики."],
  ["Как отладить свой код?", "Отладка кода может быть выполнена с помощью встроенных инструментов браузера, таких как консоль JavaScript, или с помощью специализированных отладчиков в IDE. Также полезно использовать вывод отладочной информации через `console.log`."],
  ["Каковы лучшие практики программирования?", "Некоторые лучшие практики включают написание читаемого кода, использование комментариев, соблюдение принципов DRY (Don't Repeat Yourself) и KISS (Keep It Simple, Stupid), а также регулярное тестирование кода."],
  ["Что такое API?", "API (Application Programming Interface) — это набор правил и протоколов, позволяющих различным программам взаимодействовать друг с другом."],
  ["Как защитить свой код?", "Защита кода включает в себя использование методов шифрования, проверку входных данных, регулярные обновления и использование безопасных библиотек и фреймворков."],
];


